notes/talks/new_year_raku/Z8-videos_on_raku.md
- [Raku Videos](#orga21ac8b)
  - [Leon Timmermans, "Raku syntax I miss in other languages', Jun 8, 2021](#org626e9c0)
    - [<https://www.youtube.com/watch?v=elalwvfmYgk>](#org31b42d8)
    - [Hyperoperators, Junctions, etc](#org5ffd38b)
  - [Elizabeth Mattjsen - "Raku - Sets without Borders", Jul 17, 2021](#org9991df0)
    - [<https://www.youtube.com/watch?v=ymyFchbu_GQ>](#org67bc537)
    - [set operators Just Work with arrays, hashes, etc](#org0fc017d)
  - [Jonathan Worthington on CAP ("Concurrency, Asynchrony, Parallelism")](#orge5692fe)
    - ["Concurrency, Parallelism and Asynchrony: Perl 6 plotting and prototyping", Sep 10, 2013](#org8dca8ba)
    - ["Parallelism, Concurrency, and Asynchrony in Perl 6", Aug 27, 2015](#orge99812e)
  - [Larry Wall, Keynote: Erlang & Elixir Factory San Francisco, Mar 24, 2017](#org07056fa)
    - [<https://www.youtube.com/watch?v=SpH9BTMZKXc>](#org51e39d9)


<a id="orga21ac8b"></a>

# Raku Videos


<a id="org626e9c0"></a>

## Leon Timmermans, "Raku syntax I miss in other languages', Jun 8, 2021


<a id="org31b42d8"></a>

### <https://www.youtube.com/watch?v=elalwvfmYgk>


<a id="org5ffd38b"></a>

### Hyperoperators, Junctions, etc


<a id="org9991df0"></a>

## Elizabeth Mattjsen - "Raku - Sets without Borders", Jul 17, 2021


<a id="org67bc537"></a>

### <https://www.youtube.com/watch?v=ymyFchbu_GQ>


<a id="org0fc017d"></a>

### set operators Just Work with arrays, hashes, etc


<a id="orge5692fe"></a>

## Jonathan Worthington on CAP ("Concurrency, Asynchrony, Parallelism")


<a id="org8dca8ba"></a>

### "Concurrency, Parallelism and Asynchrony: Perl 6 plotting and prototyping", Sep 10, 2013

1.  <https://www.youtube.com/watch?v=xg8tAv35YFg>


<a id="orge99812e"></a>

### "Parallelism, Concurrency, and Asynchrony in Perl 6", Aug 27, 2015

1.  <https://www.youtube.com/watch?v=JpqnNCx7wVY>


<a id="org07056fa"></a>

## Larry Wall, Keynote: Erlang & Elixir Factory San Francisco, Mar 24, 2017


<a id="org51e39d9"></a>

### <https://www.youtube.com/watch?v=SpH9BTMZKXc>
